/******************** XXX ********************
 * 文件名  ：time.c
 * 描述    ：       
 * 开发平台：
 * 库版本  ：ST3.0.0  																										  
 * 项目名称： 
*********************************************************/
#include "user_time.h"

static __O uint32_t uwTick;//系统时钟

//------------------------------------------------------------------------------
//输入参数: 无
//输出参数: 无
//返 回 值: 无
//说    明: 在SYSTICK_IRQHandler()中断函数中调用，
//------------------------------------------------------------------------------	
 void HAL_IncTick(void)
{
    uwTick++;
}

//------------------------------------------------------------------------------
//输入参数: 无
//输出参数: 无
//返 回 值: 返回当前的系统Tick值
//说    明: 获取系统自开机以来的系统Tick值【10ms/Tick】
//------------------------------------------------------------------------------
uint32_t SysTick_GetCurrent(void)
{
   return uwTick;
}

//------------------------------------------------------------------------------
//输入参数: u32PreTick - 只能是上一次调用SysTick_GetCurrent()时获得的系统Tick值
//输出参数: 无
//返 回 值: 返回当前系统Tick(u32SysTickCount)与之前Tick(u32PreTice)的差值
//说    明: 获取自上一次获取系统Tick(u32PreTice)时已流逝的Tick数【10ms/Tick】
//------------------------------------------------------------------------------
uint32_t SysTick_GetLapse(uint32_t u32PreTick)
{
    volatile uint32_t u32CurTick = uwTick;
    return ((u32CurTick >= u32PreTick) ? (u32CurTick - u32PreTick):
                                         (0xFFFFFFFF - u32PreTick + u32CurTick));
}
